<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

### Download the datasets

This assignment requires you to load the spacex dataset.

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. Click on the link below to download and save the dataset (.CSV file):

 <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv" target="_blank">Spacex DataSet</a>

In [1]:
# Package IPython, and in particular ipython-sql, are used to allow us to use
#   the SQL "magics" commands %sql (single python command) and %%sql (entire notebook cell),
#   as instigated through the magic command:   %load_ext sql

# The package ipython may need to be installed in a Python environment, but it cannot be imported.
# %pip install ipython-sql

# IPython-sql is built upon the SQLAlchemy package for "connect strings", and allows for
#   SQL commands to be executed directly, from IPython or IPython notebook.
# There are some incompatibilities between sqlalchemy and later versions of ipython-sql,
#   in particular with db2 databases and the IBM Developer Skills Network lab environments.
# NB. While maintenance has ceased for ipython-sql, a new fork of the product,
#   known as jupysql is under continuing development.

%load_ext sql

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [2]:
# The prettytable provides output formatting, at its simplest.
import prettytable
prettytable.DEFAULT = 'DEFAULT'

In [3]:
# SQLite3 gives us the ability to create local file databases that use SQL language protocols.
import sqlite3

# The connect command instantiates a new file db on the local OS
#   A related command .open(db) seems to provide for reuse of an existing file.
conn = sqlite3.connect('my_data1.db')

# The conn.cursor() command gives us access to a db cursor for handling query results.
#   NB. NO cursor is required when we use the %sql magics for db interaction.
# curs = conn.cursor()

In [4]:
# The %sql magic needs initialisation with a (sqlalchemy) "connect string" to identify the db to use:
%sql sqlite:///my_data1.db

In [5]:
# Can use pandas to import a CSV file and then write this into our db,
#   using the connection opened earlier.
import pandas as pd

df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", conn, if_exists='replace', index=False, method="multi")

101

**Note: This below code is added to remove blank rows from table, creating a renamed copy**

In [6]:
# Our initially loaded table has some null-dated rows we wish to discard.
#   (NB. It actually doesn't have any rows that are not used!)

# We do this by copying valid rows to a different table.
#   This command drops that different table if it exists.

%sql DROP TABLE IF EXISTS SPACEXTABLE

 * sqlite:///my_data1.db
Done.

[]

In [7]:
%sql create table SPACEXTABLE as select * from SPACEXTBL where Date is not null

 * sqlite:///my_data1.db
Done.

[]

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [8]:
%sql select count(*) from SPACEXTABLE

 * sqlite:///my_data1.db
Done.

[(101,)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [9]:
%%sql select *
from   spacextable
where  launch_site like 'CCA%'
limit 5

 * sqlite:///my_data1.db
Done.

[('2010-06-04', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('2010-12-08', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('2012-05-22', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('2012-10-08', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('2013-03-01', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt')]

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [10]:
%sql select sum(payload_mass__kg_) as total_payload_kg from spacextable where customer = 'NASA (CRS)'

 * sqlite:///my_data1.db
Done.

[(45596,)]

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [11]:
%sql select round(Avg(payload_mass__kg_),2) as Avg_payload_kg from spacextable where booster_version like 'F9 v1.1%'

 * sqlite:///my_data1.db
Done.

[(2534.67,)]

### Task 5

##### List the date when the first successful landing outcome in ground pad was achieved.


_Hint: Use min function_

In [12]:
%sql select min(date) as Earliest_Ground_Pad from spacextable where landing_outcome = 'Success (ground pad)'

 * sqlite:///my_data1.db
Done.

[('2015-12-22',)]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [13]:
%%sql select booster_version /*, payload_mass__kg_ */
from spacextable
where landing_outcome = 'Success (drone ship)'
and (payload_mass__kg_ > 4000
and  payload_mass__kg_ < 6000)  /* Cannot use BETWEEN, as that is INCLUSIVE at each limit */

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

### Task 7




##### List the total number of successful and failure mission outcomes

In [14]:
%sql select substr(mission_outcome, 1, 7) as outcome, count(*) as nFlights from spacextable group by substr(mission_outcome, 1, 7)

 * sqlite:///my_data1.db
Done.

[('Failure', 1), ('Success', 100)]

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [15]:
%%sql select booster_version /*, payload_mass__kg_ */ from spacextable
where payload_mass__kg_ = (select max(payload_mass__kg_) from spacextable)

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4',),
 ('F9 B5 B1049.4',),
 ('F9 B5 B1051.3',),
 ('F9 B5 B1056.4',),
 ('F9 B5 B1048.5',),
 ('F9 B5 B1051.4',),
 ('F9 B5 B1049.5',),
 ('F9 B5 B1060.2 ',),
 ('F9 B5 B1058.3 ',),
 ('F9 B5 B1051.6',),
 ('F9 B5 B1060.3',),
 ('F9 B5 B1049.7 ',)]

### Task 9


##### List the records which will display the month name, failure landing_outcome in drone ship, booster version, and launch_site for launches in year 2015.

**Note: SQLite does not support monthnames. So you need to use  substr(Date, 6,2) as month to get the months and substr(Date, 0, 5)='2015' for year.**

In [16]:
%%sql 
-- DROP TABLE datename_t;
CREATE TABLE datename_t(
  month TEXT PRIMARY KEY,
  monthName TEXT
);

INSERT INTO datename_t
    SELECT '01' AS 'month', 'January' AS 'monthName'
    union all select '02', 'February'
    union all select '03', 'March'
    union all select '04', 'April'
    union all select '05', 'May'
    union all select '06', 'June'
    union all select '07', 'July'
    union all select '08', 'August'
    union all select '09', 'September'
    union all select '10', 'October'
    union all select '11', 'November'
    union all select '12', 'December'
    ;

-- select * from datename_t

 * sqlite:///my_data1.db
(sqlite3.OperationalError) table datename_t already exists
[SQL: -- DROP TABLE datename_t;
CREATE TABLE datename_t(
  month TEXT PRIMARY KEY,
  monthName TEXT
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [17]:
%%sql 
-- display the month name, failure landing_outcome in drone ship, booster version, and launch_site, for launches in 2015

select  -- substr(Date, 6,2) as Month,
        dt.monthName
        , case when landing_outcome = 'Failure (drone ship)' then 1 else 0 end as 'Failure-DroneShip'
        , booster_version
        , launch_site
from spacextable sxt
    inner join datename_t dt
    on dt.month = substr(Date, 6,2)
where substr(date,0,5) = '2015'
order by dt.month

 * sqlite:///my_data1.db
Done.

[('January', 1, 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('February', 0, 'F9 v1.1 B1013', 'CCAFS LC-40'),
 ('March', 0, 'F9 v1.1 B1014', 'CCAFS LC-40'),
 ('April', 1, 'F9 v1.1 B1015', 'CCAFS LC-40'),
 ('April', 0, 'F9 v1.1 B1016', 'CCAFS LC-40'),
 ('June', 0, 'F9 v1.1 B1018', 'CCAFS LC-40'),
 ('December', 0, 'F9 FT B1019', 'CCAFS LC-40')]

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

In [18]:
%%sql select *, rank() over (order by nOfType desc) as MostFreq
from (SELECT landing_outcome, count(*) nOfType
      FROM spacextable
      where date between '2010-06-04' and '2017-03-20'
      group by landing_outcome
      );

 * sqlite:///my_data1.db
Done.

[('No attempt', 10, 1),
 ('Failure (drone ship)', 5, 2),
 ('Success (drone ship)', 5, 2),
 ('Controlled (ocean)', 3, 4),
 ('Success (ground pad)', 3, 4),
 ('Failure (parachute)', 2, 6),
 ('Uncontrolled (ocean)', 2, 6),
 ('Precluded (drone ship)', 1, 8)]

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

<!--
## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2024-07-10 | 1.1 |Anita Verma | Changed Version|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |
-->

## <h3 align="center"> Â© IBM Corporation 2021. All rights reserved. <h3/>